[
  {
    "title": "Team-Building",
    "description": "The IEEE ESPRIT Student Branch organized a team-building event at the El Senia Guest House, at Ghar el Melh. This event presented an opportunity for members of the student branch to connect with one another.\nThe day kicked off with various team-building exercises designed to foster collaboration, communication, and teamwork among the participants. This event undoubtedly strengthened the bond among the student branch members and created lasting memories for all who attended.",
    "date": "4th March 2023",
    "location": "El Senia Guest House, at Ghar el Melh.",
    "img": "Team-building.webp"
  },
  {
    "title": "CHAINHACKS",
    "description": "The IEEE ESPRIT Student Branch, in collaboration with the Ariana Governorate, organized an exciting hackathon known as \"ChainHacks\". This 24-hour hackathon, scheduled to take place from March 11th to March 12th, aimed to leverage the power of blockchain technology in addressing the challenges faced by Ariana and its surrounding community.",
    "date": "11th - 12th March",
    "location": "ESPRIT",
    "img": "CHAINHACKS.webp"
  },
  {
    "title": "IFTAR EL Pegas",
    "description": "The IEEE ESPRIT Student Branch organized the highly anticipated second edition of Iftar El Pegas, a special event held during the holy month of Ramadan. Iftar El Pegas aimed to bring the IEEE ESPRIT SB family together for an evening filled with food, fun, and laughter, fostering a sense of unity and togetherness.",
    "date": "11th April",
    "location": "ESPRIT",
    "img": "Iftar-El-Pegas.webp"
  },
  {
    "title": "Participation in Indabax",
    "description": "The IEEE ESPRIT Student Branch showcased fervent enthusiasm at the IndabaX hackathon, fielding four teams, including their distinguished ambassador. Their commitment to collaborative innovation and dedication to advancing Machine Learning and Artificial Intelligence was evident. The event, hosted by IEEE Supcom SB and InstaDeep, featured a standout workshop titled \"Deep Dive into Large Language Models with Python.\" This immersive session, held on May 13th - 14th,, delved into the fundamentals of Large Language Models, utilizing popular Python libraries like Hugging Face's Transformers.",
    "date": "13th May - 14th May",
    "location": "SUPCOM",
    "img": "Participation-Indabax.webp"
  },
  {
    "title": "ESPRIT Engineer ing Majors Forum 3.0",
    "description": "ESPRIT Engineering Majors Forum is the 3rd edition of an annual event held by IEEE ESPRIT SB to present to ESPRIT Students and other students to get to know better Majors and Options regarding the Computer Engineering Degree at ESPRIT. This year’s edition gathered 300 participants. This year it contained 3 sessions\/ 3 days starting on June 11th till June 13th. Gathering 16 Speakers\/Students and Future Engineers in 14 different majors: TWIN, SAE, SIM, SLEAM, GAMIX, NIDS, INFINI, DS, ARCTIC, IOSYS, ERP\/BI, WIN, SE, AI. Each speaker shared their personal experience and knowledge regarding each major and interacted with the participants' questions.",
    "date": "11th 12th 13th June",
    "location": "ONLINE",
    "img": "Majors-Forum-3.0.webp"
  },
  {
    "title": "Officers Workshop Notion",
    "description": "IEEE ESPRIT SB hosted a virtual workshop for the Executive Board officers in order to initiate their work using the Notion platform, a Productivity application. This platform will unify and organize the workflow between our officers to make their tasks much easier and well-planned. The workshop was held by our IEEE ESPRIT SB General Secretary Balkis Ferjani who created and prepared the IEEE ESPRIT SB Team Space. The officers were divided into 2 groups to attend this workshop, on 30\/6\/2023 at 4 PM, and later on, the second group attended the workshop on 2\/6\/2023 at 4 PM.",
    "date": "30th june, 2nd July",
    "location": "ONLINE",
    "img": "Officers-Workshop-Notion.webp"
  },
  {
    "title": "Participation in the NASYP Congress",
    "description": "The North African Student and Young Professionals Congress (NASYP Congress) held in Cairo, Egypt, from August 24th to 27th, was a significant gathering hosted by the IEEE EUI Student Branch and the IEEE Egypt Section. This event brought together IEEE members from diverse countries, making it a truly international and collaborative meeting. It emphasized networking, cultural exchange, and featured technical workshops, talks, and panels, making it a dynamic and enriching event.",
    "date": "24th of August till 27th of August",
    "location": "CAIRO, EGYPT",
    "img": "nasyp.webp"
  },
  {
    "title": "Pegasus's Odyssey Through Galaxies",
    "description": "IEEE ESPRIT SB on Tuesday the 12th of September at ESPRIT University, had decided to climb the mountains of history once again, embarking on a new knowledge-seeking journey, in achieving a tele-bridge contact with an astronaut onboards the ISS through Pegasus’s Odyssey Through Galaxies. To bring this aspiration closer to reality, we had the privilege of hosting guest speakers who generously shared their personal anecdotes and experiences within the aerospace industry. These speakers illuminated how the convergence of IoT and AI is reshaping the aerospace landscape.",
    "date": "12th September",
    "location": "ESPRIT School of Business",
    "img": "Pegasus's-Odyssey-Through-Galaxies.webp"
  },
  {
    "title": "WORLD ROBOT OLYMPIAD Tunisia Qualifications",
    "description": "The World Robotics Olympiad is a globally acclaimed international robotics competition, dedicated to inspiring and engaging young minds in the realms of science, technology, engineering, and mathematics through exciting robotics challenges. WRO Tunisia Qualifications is going to be held at ESB, on the 17th of September The WRO-Tunisia Qualifications is a symphony of creativity, collaboration, and technological prowess—a testament to the limitless possibilities that emerge when young talents come together to shape a brighter tomorrow.",
    "date": "17th September",
    "location": "ESPRIT School of Business",
    "img": "WRO-0.webp"
  },
  {
    "title": "Participation in ESPRIT Clubs forum",
    "description": "IEEE ESPRIT SB participated in the ESPRIT Clubs' Forum held in ESPRIT on the 20th of September. The executive board gathered alongside the IEEE ESPRIT SB members to celebrate the beginning of the academic year. The event was part of the integration phase of our Student branch, all chapters, and groups gathered to explain their activities and field to the new students. The event was a major success in our recruitment phase. We shared the IEEE events, benefits, and activities while promoting our Student branch's work",
    "date": "20th September",
    "location": "ESPRIT",
    "img": "ESPRIT-Clubs-Forum.webp"
  },
  {
    "title": "Participation in SAC Officers Training 1.0",
    "description": "The IEEE SAC Tunisia held 4 training sessions, during which all IEEE Tunisia Section’s Student branch officers benefited from the IEEE SAC officer's experience and knowledge. Attendance is included in the TSYP scoring.\nFirst Session - 20\/9: \"IEEE Benefits,\" hosted by Mr. Mohamed Aziz Ben Hmiden. \nSecond Session - 21\/9: \"WIE Opportunities,\" hosted by Mr. Ala Chalghaf and Mrs. Tasnim Chiboub. \nThird Session - 27\/9: \"IEEE Event,\" hosted by Mr. Ahmed Aouididi. \nFourth Session - 28\/9: \"IEEE Treasury,\" hosted by Mr. Mohamed Neji. \n",
    "date": "20th, 21st, 27th,28th September",
    "location": "Online",
    "img": "SAC-Training-1.0.webp"
  },
  {
    "title": "IEEE ESPRIT SB Recruitment Booths",
    "description": "IEEE ESPRIT SB was held during the beginning of the academic year, recruitment booths to promote its activities, introduce new students and potential members to IEEE, and share the IEEE experience and benefits. The booths constituted a solid base to network and connect with members and students from our school which led to a major success in our recruitment campaign.",
    "date": "11th - 30th September",
    "location": "ESPRIT & ESPRIT School of Business",
    "img": "Esprit-SB-Recrutement-Booth.webp"
  },
  {
    "title": "IEEE DAY Celebration booth",
    "description": "IEEE ESPRIT SB hosted on the 4th of October an IEEE DAY celebration Booth at ESPRIT to promote and integrate new members as well as introduce them to IEEE DAY and why we celebrate such an event. We shared the IEEE benefits, presented ourselves, and encouraged them to join the community. The feedback was impressive and many new students wanted to register. After the booth, we managed to take pictures and invite people to join us at the next celebratory events on the 11th, 12th, and 13th of October.",
    "date": "4th October",
    "location": "ESPRIT",
    "img": "IEEE-Day-Booth.webp"
  },
  {
    "title": "IEEE DAY Celebration",
    "description": "IEEE ESPRIT SB held an event on the 11th of October at ESPRIT to celebrate the IEEE DAY with the New members and introduce them to the technical part of IEEE community through workshops in various fields corresponding to our units. Our chairman and Vice chairwoman shared the opening word: walked us through the IEEE benefits, what is IEEE day and how new members can join us. We then had each Units' Chairsperson introduce their units' work and familliarize our guests with the fields and thechapters\/groups\/affinity groups. We concluded this activity with the Escape Room acitivity for the IEEE Day where members and potential members enjoyed this activity that we prepared with the IEEE DAY Organizing committee",
    "date": "11th October",
    "location": "ESPRIT",
    "img": "IEEE-Day-Celebration.webp"
  },
  {
    "title": "IEEE DAY Celebration collab with IEEE SUPCOM SB",
    "description": "IEEE ESPRIT SB in conjunction with IEEE SUPCOM SB hosted a 2-day virtual event on the 12 and 13th of October at 9 PM as a form of collaboration and celebration of the IEEE Day, to encourage new members to familiarize with the IEEE community and meet both the Student branches. The 1st session was with Mr Ala Chalghaf, about the IEEE benefits. In the 2nd session, Ms. Baya Bouchaala shared the IEEE WIE Benefits with the participants. On the second day, we hosted a panel discussion about the IEEE experience with Mr Ala Chalghaf, Ms. Imen Mahdi, and Mr. Amir Baroudi who were kind enough to share their entire experience with the IEEE family.",
    "date": "12th and 13th October",
    "location": "ONLINE",
    "img": "IEEE DAY-ESPRIT-X-Supcom.webp"
  },
  {
    "title": "First AID Workshop Hyathom bin ydikom",
    "description": "The First Aid Workshop Collaboration \"Hyathom bin ydikom” is an innovative event organized jointly by the IEEE ESPRIT Student Branch, Lions Club, and the ESPRIT Club Committee. This workshop aims to provide essential first-aid training to our community, promoting safety and preparedness in the face of emergencies. It serves as an exemplary model of community service and collaboration between our organizations. The workshop was assured by a team from civil protection.",
    "date": "18th October",
    "location": "ESPRIT",
    "img": "First AID Workshop Hyathom bin ydikom.webp"
  },
  {
    "title": "TEAMBUILDING-2024",
    "description": "IEEE ESPRIT SB gladly hosted their first Team Building for the-2024 mandate in order to integrate their new members and get to know them at Villa K6 at Mnihla Tunis. This day was filled with many engaging activities and exciting games, meticulously organized by our newest partner, Penguinize. These activities not only encouraged team bonding but also infused an element of fun and excitement, making the event a success. This gathering offered a golden opportunity for our Executive Board and the latest additions to our IEEE ESPRIT SB family to come together, share their experiences, and build connections that will undoubtedly last throughout their time with us. It was a day that reflected the spirit of unity, collaboration, and enthusiasm that defines our Student Branch.",
    "date": "21st October",
    "location": "Villa K6 at Mnihla Tunis.",
    "img": "TeamBuilding-2024.webp"
  },
  {
    "title": "TSYP 11 Promotionnal Booth",
    "description": "The 11th edition of the Tunisian Students and Young Professionals (TSYP) Congress promotional booth took place at ESPRIT. This year's edition is Organized by the IEEE ESSTHS Student Branch and IEEE Tunisia Section, the info session served as a comprehensive introduction to the upcoming congress. During the booth, Our Student branch ambassador Fatma ben Mlouka shared general information such as the date, the participation fees, the venue, and key activities, including the challenges, and interactive sessions planned for the TSYP 11 Congress. The booth was followed by an info session to share more details with our members.",
    "date": "21st November",
    "location": "ESPRIT",
    "img": "TSYP 11-Promotionnal-Booth.webp"
  },
  {
    "title": "TSYP 11 Info session",
    "description": "The TSYP 11 Info Session offered a comprehensive introduction to the upcoming congress. Hosted by Asma Basly, Malek Gdoura, and our Student Branch ambassador Fatma Ben Mlouka, the session emphasized the significance of TSYP as an annual IEEE gathering in Tunisia, themed \"Silicon Valley.\" During the info session, organizers highlighted key activities, including the Student Paper Contest, challenges, and interactive sessions planned for the TSYP 11 Congress. The agenda emphasized a diverse range of opportunities for participants to contribute, learn, and showcase their expertise. The Info Session successfully set the stage for the 11th edition of the TSYP Congress, creating anticipation and excitement among attendees. As the event approaches, the enthusiasm generated during this session is expected to translate into active participation and meaningful contributions from IEEE members in Tunisia.",
    "date": "21st November",
    "location": "ESPRIT",
    "img": "TSYP 11-Info-session.webp"
  },
  {
    "title": "IEEE ESPRIT SB members 1st General Assembly",
    "description": "The chairman started the General assembly by welcoming all the members and wishing them a great mandate, encouraging them to attend the TSYP 11, and motivating them regarding their work on the challenges. Chairman and Vicewoman highlighted IEEE benefits, IEEE Tunisia Section, and IEEE ESPRIT Student Branch. Members were invited to note questions for a Q&A session. The HR manager explained the scoring system. Star members were announced, followed by a group photo. The SB Vice Chairwoman initiated the second phase of unit position designations. The Media Manager announced the Webmasters Department recruitment. We proceeded into the Student branch chapters, group, and affinity group presentation of their action plans, concluding with a Q&A session.",
    "date": "23rd November",
    "location": "ESPRIT",
    "img": ""
  },
  {
    "title": "MTS PArticipation",
    "description": "IEEE ESPRIT SB members participated in the MTS hosted by IEEE SUPCOM SB in conjunction with IEEE SMU SB. It is a first-of-its-kind initiative in Tunisia and the MENA Region. Focused on uniting 400+ students, engineers, and IT leaders, the event aims to shape the future of the Metaverse in Tunisia through conferences, workshops, and a Metaverse hackathon. The program included conferences and workshops led by experts in this field, as well as a hackathon in the Metaverse.",
    "date": "24th, 25th,26,27th November",
    "location": "Diar El Medina Hotel Hammamet, Nabeul",
    "img": "MTS-Participation.webp"
  },
  {
    "title": "Announcement Media Department",
    "description": "This workshop is the kickoff to our media department. In it we will discover: secrets of colors, pixels, and the art of visual storytelling.",
    "date": "21 January",
    "location": "Online",
    "img": "dept.webp"
  },
  {
    "title": "Graphic Design Workshop with Aziz Hbaili",
    "description": "This workshop marks the exciting launch of our Media Department! Together, we’ll dive into the fascinating world of colors, pixels, and the art of visual storytelling.",
    "date": "31 January",
    "location": "Online",
    "img": "azizz.webp"
  },
  {
    "title": "Iftar Pegas 3.0",
    "description": "Our cherished annual event held every Ramadan, where we come together to break our fast and celebrate the spirit of Ramadan in a warm, communal atmosphere.",
    "date": "14th March",
    "location": "Amphi ESPRIT",
    "img": "iftar pegas.webp"
  },
  {
    "title": "IEEE ESPRIT SB 7th Anniversary Celebration",
    "description": "A memorable gathering celebrating the 7th anniversary of IEEE ESPRIT SB at Chalet Events, bringing together members, alumni, and other student branches.",
    "date": "10th June",
    "location": "Chalet Events",
    "img": "7th anniversary pic with SB behind.webp"
  },
  {
    "title": "ESPRIT Engineering Majors Forum",
    "description": "A three-day event featuring 14 interactive sessions designed for second-year engineering students at ESPRIT, helping them explore future paths with senior student insights.",
    "date": "8-9th June",
    "location": "Online",
    "img": "esprit Engineering Forum.webp"
  },
  {
    "title": "Antenna & Microwave Tech Day with IEEE SUPCOM SB",
    "description": "",
    "date": "24th July",
    "location": "SUPCOM",
    "img": "Antgenna Tech microwave day .webp"
  },
  {
    "title": "IEEE R8 Student & Young Professional Congress 2024 Participation",
    "description": "The IEEE ESPRIT Student Branch represented ESPRIT in Grenoble, France, winning the Best Poster Award, showcasing projects, and networking with peers and professionals.",
    "date": "",
    "location": "",
    "img": "grenoble SYP.webp"
  },
  {
    "title": "IES SYP India Participation Hyderabad",
    "description": "",
    "date": "25th-27th July",
    "location": "Hyderabad",
    "img": "India.webp"
  },
  {
    "title": "IAS Annual Meeting Arizona",
    "description": "",
    "date": "24th October",
    "location": "Phoenix, Arizona",
    "img": ""
  },
  {
    "title": "Recruitment Phase & Pegasus Showroom",
    "description": "",
    "date": "11th September",
    "location": "Amphi ESPRIT",
    "img": "Pegasus Showroom.webp"
  },
  {
    "title": "IEEE DAY Celebration & Team Building",
    "description": "Celebrating IEEE Day with innovation, community, and honoring the global impact of advancing technology for humanity.",
    "date": "29th September",
    "location": "Chalet Events",
    "img": "IEEE DAY PIC.webp"
  },
  {
    "title": "Serie IEEE DAY Workshop 1: Startup Essentials Workshop with Salah Dabbech",
    "description": "",
    "date": "3rd October",
    "location": "Online",
    "img": "salah dabbech.webp"
  },
  {
    "title": "Workshop 2: Cybersecurity in Aerospace with Oussema Ben Hadj Dahmen",
    "description": "",
    "date": "5th October",
    "location": "Online",
    "img": "oussema dahman.webp"
  },
  {
    "title": "Workshop 3: PID Controller in Line Follower Robots with Heni Walha",
    "description": "",
    "date": "7th October",
    "location": "Online",
    "img": "walha.webp"
  },
  {
    "title": "Workshop 4: Introduction to IAS and IES Session with Ala Chalghaf",
    "description": "",
    "date": "7th October",
    "location": "Online",
    "img": "chalghaf.webp"
  },
  {
    "title": "Workshop 5: SIGHT Experience with Nour Sbaoulji",
    "description": "",
    "date": "8th October",
    "location": "Online",
    "img": "Sbaouelji.webp"
  },
  {
    "title": "Workshop 6: Gen Z in the Age of AI with Lamjed Bettaieb",
    "description": "",
    "date": "10th October",
    "location": "Online",
    "img": "lamjed.webp"
  },
  {
    "title": "Workshop 7: Graphic Design 101 with Aziz Hbaili",
    "description": "",
    "date": "10th October",
    "location": "Online",
    "img": "aziz hbailai.webp"
  },
  {
    "title": "Workshop 8: First Steps into Radio Frequencies with Ilyes Ben Hammouda",
    "description": "",
    "date": "11th October",
    "location": "Online",
    "img": "MTT-s.webp"
  },
 
  {
    "title": "IEEE ESPRIT SB General Assembly",
    "description": "Celebrating innovation, community, and the incredible spirit of IEEE ESPRIT SB.",
    "date": "8th October",
    "location": "ESPRIT",
    "img": "general assemblypic.webp"
  },
  {
    "title": "TSYP 12 Infosession with our Ambassador Sarra Bouden",
    "description": "Welcoming new members alongside our Annual General Meeting to advance technology for humanity.",
    "date": "13th October",
    "location": "Amphi ESPRIT",
    "img": "TSYP Infosession.webp"
  },
  {
    "title": "IEEEXtreme 18.0",
    "description": "A thrilling coding challenge testing strategy and quick thinking.",
    "date": "25th-27th October",
    "location": "ESPRIT",
    "img": "Xtreme.webp"
  },
  {
    "title": "IEEE R8 Robots Champion - Malta Participation",
    "description": "A unique competition blending coding challenges with a virtual casino theme.",
    "date": "23rd-24th November",
    "location": "Malta",
    "img": "IEEE R8 Robot Championship.webp"
  },
  {
    "title": "CS SYP Participation: Egypt",
    "description": "Thanking members for their dedication and contributions, inspiring innovation and progress.",
    "date": "31st October - 1st November",
    "location": "Egypt",
    "img": ""
  },
  {
    "title": "AWS Community Day Tunisia Vol. 2",
    "description": "AWS Community Day Tunisia Vol. 2, hosted at ESPRIT School of Business and co-organized with AWS Community Tunisia, gathered cloud professionals to explore advanced AWS technologies. The event featured expert-led sessions on Kubernetes optimization, containerization with ECR/ECS, secure cloud architecture, cost-efficient solutions, and the future of agentic AI. It fostered collaboration and knowledge sharing and strengthened Tunisia’s cloud tech ecosystem, with 20 IEEE members and 45 non-IEEE participants attending.",
    "date": "",
    "location": "ESPRIT School of Business",
    "img": "aws.png"
},
{
"title": "Pegasus Rise: 8 Years of Vision and Venture",
"description": "A 3-day celebration of the IEEE ESPRIT SB’s 8th anniversary, featuring a 14-hour SDG-focused ideathon, expert workshops, and a panel on startups and funding. Sessions covered product design, identifying meaningful problems, and career paths (consulting, entrepreneurship, freelancing). The event empowered young innovators, with 90 IEEE members and 12 guests attending.",
"date": "11-16 july 2025 ",
"location": "ESPRIT ",
"img": "Pegasus Rise.png"
},
{
"title": "Pegasus Showroom",
"description": "The annual promotional event where IEEE ESPRIT SB chapters present their work, projects, and opportunities to new students through booths, demos, and interactive activities. The showroom connected 36 IEEE members with 170 non-IEEE attendees, encouraging engagement and membership growth.",
"date": "17 september 2025 ",
"location": "ESPRIT",
"img": "Pegasus Showroom.png"
},
{
"title": "Explore IEEE",
"description": "A collaborative workshop with IEEE INSAT SB and IEEE ISETCOM SB was held at ISETCOM. The session introduced students to IEEE’s structure, benefits, resources, and opportunities, ending with an interactive quiz and giveaways to boost engagement. Attendees included 15 IEEE and 20 non-IEEE participants.",
"date": "24 Sep 2025",
"location": "ISETCOM",
"img": "Explore IEEE.png"
},
{
"title": "IEEE Day Celebration",
"description": "A multi-SB collaboration (IEEE ESPRIT SB, ENIT SB, FSS SB) celebrating global IEEE Day. The event included workshops on IEEE benefits, the Student-to-YP journey, Generative AI, CNNs, and professional development, followed by team-building activities. The celebration brought together 107 IEEE members and 1 non-IEEE guest.",
"date": "15 Oct 2025",
"location": "ESPRIT ",
"img": "Research Paper.jpg"
},
{
"title": "Research Paper Writing Workshop",
"description": "A practical workshop with Eng. Amine Ben Helal focused on mastering scientific writing by using tools such as Google Scholar, IEEE Xplore, Litmaps, and LaTeX. Participants learned paper structure, reference management, and best research practices. The session gathered 47 IEEE members.",
"date": "",
"location": "",
"img": "IEEE Day Celebration.jpg"
}
]